In [1]:
import pandas as pd

In [2]:
data = {
    'language' : [80, 67, 90],
    'maths' : [100, 78, 98],
    'science' : [98, 77, 56],
    'programming': [100, 100, 90]
}

index = ['chris', 'kevin', 'peter']

In [3]:
df = pd.DataFrame(data, index = index)

In [4]:
df

       language  maths  science  programming
chris        80    100       98          100
kevin        67     78       77          100
peter        90     98       56           90

In [5]:
df.sort_values(by='maths')

       language  maths  science  programming
kevin        67     78       77          100
peter        90     98       56           90
chris        80    100       98          100

In [6]:
df.sort_values(by='science', ascending=False)

       language  maths  science  programming
chris        80    100       98          100
kevin        67     78       77          100
peter        90     98       56           90

In [7]:
df.sort_values(by=['maths', 'science'])

       language  maths  science  programming
kevin        67     78       77          100
peter        90     98       56           90
chris        80    100       98          100

In [8]:
df.sort_values(by=['maths', 'science'], ascending=False)

       language  maths  science  programming
chris        80    100       98          100
peter        90     98       56           90
kevin        67     78       77          100

In [9]:
df.sort_values(by=['science', 'maths'], ascending=False)

       language  maths  science  programming
chris        80    100       98          100
kevin        67     78       77          100
peter        90     98       56           90

In [10]:
df['max_score'] = df.max(axis=1)

In [11]:
df

       language  maths  science  programming  max_score
chris        80    100       98          100        100
kevin        67     78       77          100        100
peter        90     98       56           90         98

In [12]:
df['min_score'] = df.min(axis=1)

In [13]:
df

       language  maths  science  programming  max_score  min_score
chris        80    100       98          100        100         80
kevin        67     78       77          100        100         67
peter        90     98       56           90         98         56